export default {
  navbar: {
    home: 'Головна',
    films: 'Фільми',
    info: {
      info: 'Інформація',
      locations: 'Кінотеатри',
      contacts: 'Контакти',
      about: 'Про нас',
    },
    signin: "Увійти",
    login: {
      title: "Авторизація",
      google: "Google",
      microsoft: "Microsoft",
      apple: "Apple",
    },
    profile: {
      tickets: "Мої квитки",
      logout: "Вийти",
      admin: "Панель адміністратора"
    },
    lang: {
      uk: "Українська",
      en: "English"
    }
  },
  pages: {
    admin: {
      menu: {
        title: "Адмін панель",
        stats: "Статистика",
        users: "Користувачі",
        films: "Фільми",
        sessions: "Сеанси"
      },
      stats: {
        users: "Загальна кількість користувачів на платформі",
        films: "Загальна кількість фільмів, доступних на платформі",
        sessions: "Кількість запланованих сеансів на найближчі дні",
        tickets_sell: "Всього продано квитків",
        month_money: "Виручка за місяць",
        week_money: "Виручка за тиждень"
      },
      users: {
        give: "Видати права адміністратора",
        take: "Забрати права адміністратора"
      },
      films: {
        add: "Добавити фільм"
      },
      sessions: {
        add: "Добавити сеанс"
      }
    },
    tickets: {
      title: "Список Квитків",
      ticket: {
        session: "Сеанс:",
        seats: "Місяця:",
        download: "Завантажити"
      }
    },
    film: {
      sessions: "Сеанси",
      notsessions: "Немає сеансів на цей фільм",
      buy: {
        seat: {
          title: "Місце",
          subtitle: "Виберіть місце/місця"
        },
        oplata: {
          title: "Оплата",
          subtitle: "Оплата квитка",
          cardNumber: {
            title: "Карта",
            subtitle: "Введіть номер вашої картки"
          },
          cardName: {
            title: "Власник карти",
            subtitle: "Введіть ім'я власника картки",
            placeholder: "Ім'я Прізвище"
          },
          expiryDate: {
            title: "Срок карти",
          },
          cvv: {
            title: "CVV",
            subtitle: "3 цифри з тильної сторони картки",
            placeholder: "CVV"
          },
        },
        next: "Далі",
        buy: "Оплатить",
        price: "₴",
      },
      payment: {
        exception: {
          session_not_found: "Сеанс не знайдено",
          not_enough_seats: "Немає вільних місць",
          invalid_seats: "Вибрані вами місця уже зайняті",
          invalid_card: "Направельні данні карти"
        }
      }
    },
    films: {
      title: "Список фільмів",
      search: {
        title: "Пошук:",
        placeholder: "Введіть ключові слова"
      },
      sort: {
        title: "Сортувати за:",
        date: "Дата",
        name: "Назва",
        price: "Ціна"
      },
      buy: "Купити",
      price: "₴",
      more: "Завантажити більше",
      nomore: "Ви завантажили всі новинки на даний час"
    },
    info: {
      about: {
        title: "КіноХата — це більше, ніж кіно!",
        text1: "Наш кінотеатр — це також місце для зустрічей із друзями, романтичних побачень або сімейного відпочинку. Ми часто організовуємо тематичні кінопокази, прем'єри, зустрічі з режисерами та багато іншого.",
        subtitle: "Наша історія — шлях до вашого серця",
        text2: "Кінотеатр \"КіноХата\" розпочав свою подорож з великої мрії: створити місце, де кожен глядач відчуватиме себе вдома, насолоджуючись найкращими кінематографічними моментами.",
        text3: "Все почалося з маленького залу, де група ентузіастів крутила культові стрічки для найближчих друзів. Проте любов до кіно та прагнення дарувати радість змусили нас рости. Ми розширили наші зали, оснастили їх сучасним обладнанням і зробили все, щоб кожен ваш візит ставав незабутнім.",
        text4: "Наш логотип — хатинка — символізує тепло та затишок, які ми хочемо дарувати кожному відвідувачу. Ідея створити такий кінотеатр народилася з дитячих спогадів: як вечорами ми дивилися фільми всією родиною, збираючись у невеликій кімнаті, де панувала атмосфера єднання."
      },
      contacts: {
        title: "Контакти",
        email: "kinoxata@gmail.com",
        phone: "+380000000000"
      },
      cinemas: {
        title: "Наші кінотеатри"
      }
    }
  },
  form: {
    successful: "Операція успішна",
    noinput: "Не всі поля заповнені",
    add: "Добавити",
    edit: "Змінити",
    delete: "Видалити",
    close: "Закрити"
  }
} as const
